Revit 2027 API
RenderingSettings.SetBackgroundSettings Method
 Changes the rendering background settings details for the current background style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBackgroundSettings(
	BackgroundSettings background
)
Public Sub SetBackgroundSettings (
	background As BackgroundSettings
)
public:
void SetBackgroundSettings(
	BackgroundSettings^ background
)
member SetBackgroundSettings :
        background : BackgroundSettings -> unit
Parameters
background BackgroundSettings
 An instance of the new rendering background settings.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace